# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Settings
cask_args appdir: '/Applications'

# Libs
brew "openssl"
brew 'coreutils'
brew 'md5sha1sum'
brew "ctags"
brew "libxml2"
brew 'libpng'
brew 'freetype'
brew 'ffmpeg'
brew 'readline'
brew 'doxygen'

# UNIX Tools
brew 'git'
brew 'ant'
brew 'ack'
brew "tmux"
brew "vim"
brew "zsh"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "httpie"
brew "curl"
brew 'vimpager'
brew 'p7zip'
brew 'grep'
brew 'tree'

# Heroku & GitHub
brew 'heroku-toolbelt'
brew 'hub'
brew 'awscli'

# Docker
brew 'docker'

# Image manipulation
brew 'imagemagick'

# Testing
brew 'qt'
brew 'jmeter'

# Programming languages
brew "libyaml" # should come after openssl
brew "nvm"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
brew "sqlite"
brew "mongodb", restart_service: true
brew "mysql", restart_service: true

# Automation
brew "chromedriver"
brew "geckodriver"
brew "phantomjs"

# Mac Stuff
brew 'm-cli'

# Cask QL Plugins
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'quicklook-json'

# Cask Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-ubuntu'
cask 'font-source-sans-pro'

# Apps
cask 'charles'
cask 'mongohub'
cask 'postman'
cask 'slack'
cask 'github-desktop'
cask 'virtualbox'
cask 'vagrant'
cask 'firefox'
cask 'google-chrome'
cask 'atom'
cask 'sublime-text'
cask 'macdown'
cask 'java'
cask 'sequel-pro'
cask 'soapui'
