# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Settings
cask_args appdir: '/Applications'

# UNIX Tools
brew 'git'
brew "zsh"
brew "curl"
brew 'tree'

# Heroku & GitHub
brew 'heroku-toolbelt'
brew 'awscli'

# Docker
brew 'docker'

# Testing
brew 'jmeter'

# Programming languages
brew "nvm"
brew "rbenv"

# Databases
brew "mongodb", restart_service: true
brew "mysql"

# Automation
brew "chromedriver"
brew "geckodriver"

# Apps
cask 'postman'
cask 'slack'
cask 'virtualbox'
cask 'vagrant'
cask 'google-chrome'
cask 'atom'
cask 'sublime-text'
cask 'macdown'
cask 'java'
